# DebugtabDataboundcontrolsdemoEnum Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DebugtabDataboundcontrolsdemoEnum Property
ParameterTypeId Class See Also
---
"Options"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DebugtabDataboundcontrolsdemoEnum { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DebugtabDataboundcontrolsdemoEnum As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DebugtabDataboundcontrolsdemoEnum {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace